---
type: MEPSize
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# MEPSize

`Autodesk.Revit.DB.MEPSize` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MEPSize | 2012 | `public MEPSize ( double nominalDiameter , double innerDiameter , double outerDiameter , bool usedInSizeLists , bool usedInSizing )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | InnerDiameter | 2012 | `public double InnerDiameter { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NominalDiameter | 2012 | `public double NominalDiameter { get ; }` |
| Property | OuterDiameter | 2012 | `public double OuterDiameter { get ; }` |
| Property | UsedInSizeLists | 2012 | `public bool UsedInSizeLists { get ; }` |
| Property | UsedInSizing | 2012 | `public bool UsedInSizing { get ; }` |